wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_syscfg.h
/*!
    \file    gd32f50x_syscfg.h
    \brief   definitions for the SYSCFG

    \version 2025-11-10, V1.01, firmware for GD32F50x
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32F50X_SYSCFG_H
#define GD32F50X_SYSCFG_H

#include "gd32f50x.h"

/* peripheral definitions */
/* peripheral base addresses */
#define SYSCFG                     SYSCFG_BASE                                                     /*!< SYSCFG base address */

/* registers definitions */                            
#define SYSCFG_CFG0                            REG32((SYSCFG) + 0x00000000U)                       /*!< SYSCFG configuration register 0 */
#define SYSCFG_CFG1                            REG32((SYSCFG) + 0x00000004U)                       /*!< SYSCFG configuration register 1 */
#define SYSCFG_LKCTL                           REG32((SYSCFG) + 0x00000018U)                       /*!< SYSCFG lockup control register */
#define SYSCFG_BUSTO                           REG32((SYSCFG) + 0x0000001CU)                       /*!< SYSCFG bus timeout register */
#define SYSCFG_TIMERCISEL                      REG32((SYSCFG) + 0x00000020U)                       /*!< SYSCFG timer input selection register */
#define SYSCFG_FPUINTEN                        REG32((SYSCFG) + 0x00000024U)                       /*!< SYSCFG FPU interrupt enable register */
#define SYSCFG_SRAMWP                          REG32((SYSCFG) + 0x00000028U)                       /*!< SYSCFG SRAM write protection register */
#define SYSCFG_SRAMECCSTAT                     REG32((SYSCFG) + 0x0000002CU)                       /*!< SYSCFG SRAM ECC status register */
#define SYSCFG_SRAMECCCS                       REG32((SYSCFG) + 0x00000030U)                       /*!< SYSCFG SRAM ECC control and status register */
#define SYSCFG_BUSTOSTAT                       REG32((SYSCFG) + 0x00000034U)                       /*!< SYSCFG bus timeout status register */
#define SYSCFG_TIMER0TRGCFG0                   REG32((SYSCFG) + 0x00000100U)                       /*!< Timer0 TRG configuration register */
#define SYSCFG_TIMER0TRGCFG1                   REG32((SYSCFG) + 0x00000104U)                       /*!< Timer0 TRG configuration register */
#define SYSCFG_TIMER0TRGCFG2                   REG32((SYSCFG) + 0x00000108U)                       /*!< Timer0 TRG configuration register */
#define SYSCFG_TIMER1TRGCFG0                   REG32((SYSCFG) + 0x0000010CU)                       /*!< Timer1 TRG configuration register */
#define SYSCFG_TIMER1TRGCFG1                   REG32((SYSCFG) + 0x00000110U)                       /*!< Timer1 TRG configuration register */
#define SYSCFG_TIMER1TRGCFG2                   REG32((SYSCFG) + 0x00000114U)                       /*!< Timer1 TRG configuration register */
#define SYSCFG_TIMER2TRGCFG0                   REG32((SYSCFG) + 0x00000118U)                       /*!< Timer2 TRG configuration register */
#define SYSCFG_TIMER2TRGCFG1                   REG32((SYSCFG) + 0x0000011CU)                       /*!< Timer2 TRG configuration register */
#define SYSCFG_TIMER2TRGCFG2                   REG32((SYSCFG) + 0x00000120U)                       /*!< Timer2 TRG configuration register */
#define SYSCFG_TIMER3TRGCFG0                   REG32((SYSCFG) + 0x00000124U)                       /*!< Timer3 TRG configuration register */
#define SYSCFG_TIMER3TRGCFG1                   REG32((SYSCFG) + 0x00000128U)                       /*!< Timer3 TRG configuration register */
#define SYSCFG_TIMER3TRGCFG2                   REG32((SYSCFG) + 0x0000012CU)                       /*!< Timer3 TRG configuration register */
#define SYSCFG_TIMER4TRGCFG0                   REG32((SYSCFG) + 0x00000130U)                       /*!< Timer4 TRG configuration register */
#define SYSCFG_TIMER4TRGCFG1                   REG32((SYSCFG) + 0x00000134U)                       /*!< Timer4 TRG configuration register */
#define SYSCFG_TIMER4TRGCFG2                   REG32((SYSCFG) + 0x00000138U)                       /*!< Timer4 TRG configuration register */
#define SYSCFG_TIMER7TRGCFG0                   REG32((SYSCFG) + 0x0000013CU)                       /*!< Timer7 TRG configuration register */
#define SYSCFG_TIMER7TRGCFG1                   REG32((SYSCFG) + 0x00000140U)                       /*!< Timer7 TRG configuration register */
#define SYSCFG_TIMER7TRGCFG2                   REG32((SYSCFG) + 0x00000144U)                       /*!< Timer7 TRG configuration register */
#define SYSCFG_TIMER15TRGCFG0                  REG32((SYSCFG) + 0x00000148U)                       /*!< Timer15 TRG configuration register */
#define SYSCFG_TIMER15TRGCFG1                  REG32((SYSCFG) + 0x0000014CU)                       /*!< Timer15 TRG configuration register */
#define SYSCFG_TIMER15TRGCFG2                  REG32((SYSCFG) + 0x00000150U)                       /*!< Timer15 TRG configuration register */
#define SYSCFG_TIMER16TRGCFG0                  REG32((SYSCFG) + 0x00000154U)                       /*!< Timer16 TRG configuration register */
#define SYSCFG_TIMER16TRGCFG1                  REG32((SYSCFG) + 0x00000158U)                       /*!< Timer16 TRG configuration register */
#define SYSCFG_TIMER16TRGCFG2                  REG32((SYSCFG) + 0x0000015CU)                       /*!< Timer16 TRG configuration register */

