wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_syscfg.h
/* bits definitions */

/* SYSCFG_CFG0 */
#define SYSCFG_CFG0_BOOT_MODE                  BITS(0,2)                                           /*!< boot mode */

/* SYSCFG_CFG1 */                              
#define SYSCFG_CFG1_I2C0FMP                    BIT(0)                                              /*!< I2C0 Fm+ enable */
#define SYSCFG_CFG1_I2C1FMP                    BIT(1)                                              /*!< I2C1 Fm+ enable */

/* SYSCFG_LKCTL */                              
#define SYSCFG_LKCTL_LVD_LOCK                  BIT(2)                                              /*!< low voltage detector lockup bit */
#define SYSCFG_LKCTL_CPU_LOCK                  BIT(6)                                              /*!< CPU lockup bit */
#define SYSCFG_LKCTL_SRAM_LOCK                 BIT(12)                                             /*!< SRAM ECC double error lockup bit */

/* SYSCFG_BUSTO */                              
#define SYSCFG_BUSTO_CPUCBUSTO                 BIT(0)                                              /*!< CPU Cbus timeout enable bit */
#define SYSCFG_BUSTO_CPUSBUSTO                 BIT(1)                                              /*!< CPU Sbus timeout enable bit */
#define SYSCFG_BUSTO_DMA0BUSTO                 BIT(2)                                              /*!< DMA0 bus timeout enable bit */
#define SYSCFG_BUSTO_DMA1BUSTO                 BIT(3)                                              /*!< DMA1 bus timeout enable bit */

/* SYSCFG_TIMERCISEL */                             
#define SYSCFG_TIMERCISEL_TIMER15_CI0_SEL      BITS(0,1)                                           /*!< TIMER15_CI0 input selection */
#define SYSCFG_TIMERCISEL_TIMER16_CI0_SEL      BITS(4,5)                                           /*!< TIMER16_CI0 input selection */

/* SYSCFG_FPUINTEN */                               
#define SYSCFG_FPUINTEN_IOPIE                  BIT(0)                                              /*!< invalid operation interrupt enable bit */
#define SYSCFG_FPUINTEN_DZIE                   BIT(1)                                              /*!< divide by 0 interrupt enable bit */
#define SYSCFG_FPUINTEN_UFIE                   BIT(2)                                              /*!< underflow interrupt enable bit */
#define SYSCFG_FPUINTEN_OVFIE                  BIT(3)                                              /*!< overflow interrupt enable bit */
#define SYSCFG_FPUINTEN_IAIE                   BIT(4)                                              /*!< input abnormal interrupt enable bit */
#define SYSCFG_FPUINTEN_IXIE                   BIT(5)                                              /*!< inexact interrupt enable bit */

/* SYSCFG_SRAMWP */                            
#define SYSCFG_SRAMWP_SRAM_P0WP                BIT(0)                                              /*!< SRAM page 0 write protection */
#define SYSCFG_SRAMWP_SRAM_P1WP                BIT(1)                                              /*!< SRAM page 1 write protection */
#define SYSCFG_SRAMWP_SRAM_P2WP                BIT(2)                                              /*!< SRAM page 2 write protection */
#define SYSCFG_SRAMWP_SRAM_P3WP                BIT(3)                                              /*!< SRAM page 3 write protection */
#define SYSCFG_SRAMWP_SRAM_P4WP                BIT(4)                                              /*!< SRAM page 4 write protection */
#define SYSCFG_SRAMWP_SRAM_P5WP                BIT(5)                                              /*!< SRAM page 5 write protection */
#define SYSCFG_SRAMWP_SRAM_P6WP                BIT(6)                                              /*!< SRAM page 6 write protection */
#define SYSCFG_SRAMWP_SRAM_P7WP                BIT(7)                                              /*!< SRAM page 7 write protection */
#define SYSCFG_SRAMWP_SRAM_P8WP                BIT(8)                                              /*!< SRAM page 8 write protection */
#define SYSCFG_SRAMWP_SRAM_P9WP                BIT(9)                                              /*!< SRAM page 9 write protection */
#define SYSCFG_SRAMWP_SRAM_P10WP               BIT(10)                                             /*!< SRAM page 10 write protection */
#define SYSCFG_SRAMWP_SRAM_P11WP               BIT(11)                                             /*!< SRAM page 11 write protection */
#define SYSCFG_SRAMWP_SRAM_P12WP               BIT(12)                                             /*!< SRAM page 12 write protection */
#define SYSCFG_SRAMWP_SRAM_P13WP               BIT(13)                                             /*!< SRAM page 13 write protection */
#define SYSCFG_SRAMWP_SRAM_P14WP               BIT(14)                                             /*!< SRAM page 14 write protection */
#define SYSCFG_SRAMWP_SRAM_P15WP               BIT(15)                                             /*!< SRAM page 15 write protection */
#define SYSCFG_SRAMWP_SRAM_P16WP               BIT(16)                                             /*!< SRAM page 16 write protection */
#define SYSCFG_SRAMWP_SRAM_P17WP               BIT(17)                                             /*!< SRAM page 17 write protection */
#define SYSCFG_SRAMWP_SRAM_P18WP               BIT(18)                                             /*!< SRAM page 18 write protection */
#define SYSCFG_SRAMWP_SRAM_P19WP               BIT(19)                                             /*!< SRAM page 19 write protection */
#define SYSCFG_SRAMWP_SRAM_P20WP               BIT(20)                                             /*!< SRAM page 20 write protection */
#define SYSCFG_SRAMWP_SRAM_P21WP               BIT(21)                                             /*!< SRAM page 21 write protection */
#define SYSCFG_SRAMWP_SRAM_P22WP               BIT(22)                                             /*!< SRAM page 22 write protection */
#define SYSCFG_SRAMWP_SRAM_P23WP               BIT(23)                                             /*!< SRAM page 23 write protection */
#define SYSCFG_SRAMWP_SRAM_P24WP               BIT(24)                                             /*!< SRAM page 24 write protection */
#define SYSCFG_SRAMWP_SRAM_P25WP               BIT(25)                                             /*!< SRAM page 25 write protection */
#define SYSCFG_SRAMWP_SRAM_P26WP               BIT(26)                                             /*!< SRAM page 26 write protection */
#define SYSCFG_SRAMWP_SRAM_P27WP               BIT(27)                                             /*!< SRAM page 27 write protection */
#define SYSCFG_SRAMWP_SRAM_P28WP               BIT(28)                                             /*!< SRAM page 28 write protection */
#define SYSCFG_SRAMWP_SRAM_P29WP               BIT(29)                                             /*!< SRAM page 29 write protection */
#define SYSCFG_SRAMWP_SRAM_P30WP               BIT(30)                                             /*!< SRAM page 30 write protection */
#define SYSCFG_SRAMWP_SRAM_P31WP               BIT(31)                                             /*!< SRAM page 31 write protection */

/* SYSCFG_SRAMECCSTAT */                               
#define SYSCFG_SRAMECCSTAT_SRAMECCMEIF         BIT(0)                                              /*!< SRAM non-correction event detected */
#define SYSCFG_SRAMECCSTAT_SRAMECCSEIF         BIT(1)                                              /*!< SRAM single bit correction event detected */

/* SYSCFG_SRAMECCCS */
#define SYSCFG_SRAMECCCS_SRAMECCMEIE           BIT(3)                                              /*!< SRAM multi-bit non-correction interrupt enable */
#define SYSCFG_SRAMECCCS_SRAMECCSEIE           BIT(4)                                              /*!< SRAM single bit correction interrupt enable */
#define SYSCFG_SRAMECCCS_SRAMECCSERRBITS       BITS(10,15)                                         /*!< which one bit has an SRAM ECC single-bit correctable error */
#define SYSCFG_SRAMECCCS_SRAMECCADDR           BITS(19,31)                                         /*!< faulting system address where the last ECC event on SRAM occurred */
                               
/* SYSCFG_BUSTOSTAT */                             
#define SYSCFG_BUSTOSTAT_CPUCBUSTOF            BIT(0)                                              /*!< CPU Cbus timeout flag */
#define SYSCFG_BUSTOSTAT_CPUSBUSTOF            BIT(1)                                              /*!< CPU Sbus timeout flag */
#define SYSCFG_BUSTOSTAT_DMA0BUSTOF            BIT(2)                                              /*!< DMA0 bus timeout flag */
#define SYSCFG_BUSTOSTAT_DMA1BUSTOF            BIT(3)                                              /*!< DMA1 bus timeout flag */

/* SYSCFG_TIMERxCFG */
#define SYSCFG_TIMERCFG_TSCFG0                 BITS(0,4)                                           /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG1                 BITS(5,9)                                           /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG2                 BITS(10,14)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG3                 BITS(16,20)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG4                 BITS(21,25)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG5                 BITS(26,30)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG6                 BITS(0,4)                                           /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG9                 BITS(16,20)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG10                BITS(21,25)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG11                BITS(26,30)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG12                BITS(0,4)                                           /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG13                BITS(5,9)                                           /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG14                BITS(10,14)                                         /*!< TIMER trigger selection */
#define SYSCFG_TIMERCFG_TSCFG15                BITS(16,20)                                         /*!< TIMER trigger selection */

/* constants definitions */
/* boot mode definitions */
#define BOOT_MODE(regval)                  (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define SYSCFG_BOOTMODE_FLASH              BOOT_MODE(0)                                           /*!< boot from main flash */
#define SYSCFG_BOOTMODE_BOOTLOADER         BOOT_MODE(1)                                           /*!< boot from bootloader */
#define SYSCFG_BOOTMODE_SRAM               BOOT_MODE(3)                                           /*!< boot from embedded SRAM */
#define SYSCFG_BOOTMODE_OTP1               BOOT_MODE(5)                                           /*!< boot from embedded OTP1 */

/* I2Cx fast mode plus enable definitions */
#define SYSCFG_I2C0_FMP                    SYSCFG_CFG1_I2C0FMP                                    /*!< I2C0 fast mode plus enable */
#define SYSCFG_I2C1_FMP                    SYSCFG_CFG1_I2C1FMP                                    /*!< I2C1 fast mode plus enable */

/* lockup enable */
#define SYSCFG_CPU_LOCKUP                  SYSCFG_LKCTL_CPU_LOCK                                  /*!< CPU lockup signal is connected  */
#define SYSCFG_SRAM_LOCKUP                 SYSCFG_LKCTL_SRAM_LOCK                                 /*!< SRAM ECC double error signal is connected */
#define SYSCFG_LVD_LOCKUP                  SYSCFG_LKCTL_LVD_LOCK                                  /*!< LVD signal is connected */

/* bus timeout enable */
#define SYSCFG_CPUCBUS_TIMEROUT            SYSCFG_BUSTO_CPUCBUSTO                                 /*!< CPU Cbus timeout enable */
#define SYSCFG_CPUSBUS_TIMEROUT            SYSCFG_BUSTO_CPUSBUSTO                                 /*!< CPU Sbus timeout enable */
#define SYSCFG_DMA0BUS_TIMEROUT            SYSCFG_BUSTO_DMA0BUSTO                                 /*!< DMA0 bus timeout enable */
#define SYSCFG_DMA1BUS_TIMEROUT            SYSCFG_BUSTO_DMA1BUSTO                                 /*!< DMA1 bus timeout enable */

/* SRAM page write protection */
#define SYSCFG_SRAM_WP_PAGE0               SYSCFG_SRAMWP_SRAM_P0WP                                /*!< SRAM page 0 write protection */
#define SYSCFG_SRAM_WP_PAGE1               SYSCFG_SRAMWP_SRAM_P1WP                                /*!< SRAM page 1 write protection */
#define SYSCFG_SRAM_WP_PAGE2               SYSCFG_SRAMWP_SRAM_P2WP                                /*!< SRAM page 2 write protection */
#define SYSCFG_SRAM_WP_PAGE3               SYSCFG_SRAMWP_SRAM_P3WP                                /*!< SRAM page 3 write protection */
#define SYSCFG_SRAM_WP_PAGE4               SYSCFG_SRAMWP_SRAM_P4WP                                /*!< SRAM page 4 write protection */
#define SYSCFG_SRAM_WP_PAGE5               SYSCFG_SRAMWP_SRAM_P5WP                                /*!< SRAM page 5 write protection */
#define SYSCFG_SRAM_WP_PAGE6               SYSCFG_SRAMWP_SRAM_P6WP                                /*!< SRAM page 6 write protection */
#define SYSCFG_SRAM_WP_PAGE7               SYSCFG_SRAMWP_SRAM_P7WP                                /*!< SRAM page 7 write protection */
#define SYSCFG_SRAM_WP_PAGE8               SYSCFG_SRAMWP_SRAM_P8WP                                /*!< SRAM page 8 write protection */
#define SYSCFG_SRAM_WP_PAGE9               SYSCFG_SRAMWP_SRAM_P9WP                                /*!< SRAM page 9 write protection */
#define SYSCFG_SRAM_WP_PAGE10              SYSCFG_SRAMWP_SRAM_P10WP                               /*!< SRAM page 10 write protection */
#define SYSCFG_SRAM_WP_PAGE11              SYSCFG_SRAMWP_SRAM_P11WP                               /*!< SRAM page 11 write protection */
#define SYSCFG_SRAM_WP_PAGE12              SYSCFG_SRAMWP_SRAM_P12WP                               /*!< SRAM page 12 write protection */
#define SYSCFG_SRAM_WP_PAGE13              SYSCFG_SRAMWP_SRAM_P13WP                               /*!< SRAM page 13 write protection */
#define SYSCFG_SRAM_WP_PAGE14              SYSCFG_SRAMWP_SRAM_P14WP                               /*!< SRAM page 14 write protection */
#define SYSCFG_SRAM_WP_PAGE15              SYSCFG_SRAMWP_SRAM_P15WP                               /*!< SRAM page 15 write protection */
#define SYSCFG_SRAM_WP_PAGE16              SYSCFG_SRAMWP_SRAM_P16WP                               /*!< SRAM page 16 write protection */
#define SYSCFG_SRAM_WP_PAGE17              SYSCFG_SRAMWP_SRAM_P17WP                               /*!< SRAM page 17 write protection */
#define SYSCFG_SRAM_WP_PAGE18              SYSCFG_SRAMWP_SRAM_P18WP                               /*!< SRAM page 18 write protection */
#define SYSCFG_SRAM_WP_PAGE19              SYSCFG_SRAMWP_SRAM_P19WP                               /*!< SRAM page 19 write protection */
#define SYSCFG_SRAM_WP_PAGE20              SYSCFG_SRAMWP_SRAM_P20WP                               /*!< SRAM page 20 write protection */
#define SYSCFG_SRAM_WP_PAGE21              SYSCFG_SRAMWP_SRAM_P21WP                               /*!< SRAM page 21 write protection */
#define SYSCFG_SRAM_WP_PAGE22              SYSCFG_SRAMWP_SRAM_P22WP                               /*!< SRAM page 22 write protection */
#define SYSCFG_SRAM_WP_PAGE23              SYSCFG_SRAMWP_SRAM_P23WP                               /*!< SRAM page 23 write protection */
#define SYSCFG_SRAM_WP_PAGE24              SYSCFG_SRAMWP_SRAM_P24WP                               /*!< SRAM page 24 write protection */
#define SYSCFG_SRAM_WP_PAGE25              SYSCFG_SRAMWP_SRAM_P25WP                               /*!< SRAM page 25 write protection */
#define SYSCFG_SRAM_WP_PAGE26              SYSCFG_SRAMWP_SRAM_P26WP                               /*!< SRAM page 26 write protection */
#define SYSCFG_SRAM_WP_PAGE27              SYSCFG_SRAMWP_SRAM_P27WP                               /*!< SRAM page 27 write protection */
#define SYSCFG_SRAM_WP_PAGE28              SYSCFG_SRAMWP_SRAM_P28WP                               /*!< SRAM page 28 write protection */
#define SYSCFG_SRAM_WP_PAGE29              SYSCFG_SRAMWP_SRAM_P29WP                               /*!< SRAM page 29 write protection */
#define SYSCFG_SRAM_WP_PAGE30              SYSCFG_SRAMWP_SRAM_P30WP                               /*!< SRAM page 30 write protection */
#define SYSCFG_SRAM_WP_PAGE31              SYSCFG_SRAMWP_SRAM_P31WP                               /*!< SRAM page 31 write protection */

/* FPU interrupt enable */
#define SYSCFG_FPUINT_INVALID_OPERATION    SYSCFG_FPUINTEN_IOPIE                                  /*!< invalid operation interrupt enable */
#define SYSCFG_FPUINT_DIV0                 SYSCFG_FPUINTEN_DZIE                                   /*!< divide-by-zero interrupt enable */
#define SYSCFG_FPUINT_UNDERFLOW            SYSCFG_FPUINTEN_UFIE                                   /*!< underflow interrupt enable */
#define SYSCFG_FPUINT_OVERFLOW             SYSCFG_FPUINTEN_OVFIE                                  /*!< overflow interrupt enable */
#define SYSCFG_FPUINT_INPUT_ABNORMAL       SYSCFG_FPUINTEN_IAIE                                   /*!< input abnormal interrupt enable */
#define SYSCFG_FPUINT_INEXACT              SYSCFG_FPUINTEN_IXIE                                   /*!< inexact interrupt enable */

/* TIMER15_CI0 input selection */
#define TIMER15_CI0_SEL(regval)          (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define TIMER16_CI0_SEL(regval)          (BITS(4,5) & ((uint32_t)(regval) << 4U))

/* TIMER channel input select mask definitions */
#define SYSCFG_TIMERCISEL_TIMER15_CI0_SEL   BITS(0,1)                                               /*!< TIMER15 CI0 input selection mask */
#define SYSCFG_TIMERCISEL_TIMER16_CI0_SEL   BITS(4,5)                                               /*!< TIMER16 CI0 input selection mask */

