wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_syscfg.h
/* Define the TIMER bit position and selection value encoding */
#define TIMER_CHANNEL_BIT(timer_id, bitpos, value)   (((uint32_t)(timer_id) << 8U) | ((uint32_t)(bitpos) << 4U) | ((uint32_t)(value)))
#define TIMER_GET_ID(val)                   (((uint32_t)(val) & 0x0F00U) >> 8U)                     /*!< Extract timer ID */
#define TIMER_GET_BITPOS(val)               (((uint32_t)(val) & 0x00F0U) >> 4U)                     /*!< Extract bit position */
#define TIMER_GET_VALUE(val)                ((uint32_t)(val) & 0x000FU)                             /*!< Extract selection value */

/* Timer ID definitions */
#define TIMER15_ID                          0x01U                                                   /*!< TIMER15 identifier */
#define TIMER16_ID                          0x02U                                                   /*!< TIMER16 identifier */

/* TIMERx channel input select definitions */
typedef enum {
    /* TIMER15 CI0 input selections */
    TIMER15_CI0_INPUT_TIMER15_CH0       = TIMER_CHANNEL_BIT(TIMER15_ID, 0U, 0U),                   /*!< Select TIMER15_CH0 as TIMER15 CI0 */
    TIMER15_CI0_INPUT_IRC40K            = TIMER_CHANNEL_BIT(TIMER15_ID, 0U, 1U),                   /*!< Select IRC40K as TIMER15 CI0 */
    TIMER15_CI0_INPUT_LXTAL             = TIMER_CHANNEL_BIT(TIMER15_ID, 0U, 2U),                   /*!< Select LXTAL as TIMER15 CI0 */

    /* TIMER16 CI0 input selections */
    TIMER16_CI0_INPUT_TIMER16_CH0       = TIMER_CHANNEL_BIT(TIMER16_ID, 4U, 0U),                   /*!< Select TIMER16_CH0 as TIMER16 CI0 */
    TIMER16_CI0_INPUT_CKOUT             = TIMER_CHANNEL_BIT(TIMER16_ID, 4U, 3U)                    /*!< Select CKOUT as TIMER16 CI0 */
} timer_channel_input_enum;

/* timer tigger source select definition */                             
#define TIMER_SMCFG_TRGSEL_NONE             ((uint8_t)0x00U)                                       /*!< trigger input is none */
#define TIMER_SMCFG_TRGSEL_ITI0             ((uint8_t)0x01U)                                       /*!< internal trigger input 0 */
#define TIMER_SMCFG_TRGSEL_ITI1             ((uint8_t)0x02U)                                       /*!< internal trigger input 1 */
#define TIMER_SMCFG_TRGSEL_ITI2             ((uint8_t)0x03U)                                       /*!< internal trigger input 2 */
#define TIMER_SMCFG_TRGSEL_ITI3             ((uint8_t)0x04U)                                       /*!< internal trigger input 3 */
#define TIMER_SMCFG_TRGSEL_CI0F_ED          ((uint8_t)0x05U)                                       /*!< TI0 edge detector */
#define TIMER_SMCFG_TRGSEL_CI0FE0           ((uint8_t)0x06U)                                       /*!< filtered TIMER input 0 */
#define TIMER_SMCFG_TRGSEL_CI1FE1           ((uint8_t)0x07U)                                       /*!< filtered TIMER input 1 */
#define TIMER_SMCFG_TRGSEL_ETIFP            ((uint8_t)0x08U)                                       /*!< external trigger */
#define TIMER_SMCFG_TRGSEL_CI2FE2           ((uint8_t)0x09U)                                       /*!< filtered TIMER input 2 */
#define TIMER_SMCFG_TRGSEL_CI3FE3           ((uint8_t)0x0AU)                                       /*!< filtered TIMER input 3 */
#define TIMER_SMCFG_TRGSEL_MCI0FEM0         ((uint8_t)0x0BU)                                       /*!< filtered output of multi mode channel 0 input */
#define TIMER_SMCFG_TRGSEL_ITI14            ((uint8_t)0x13U)                                       /*!< internal trigger input 14 */
                                
/* timer tigger mode select definition */                               
#define TIMER_QUAD_DECODER_MODE0            ((uint8_t)0x00U)                                       /*!< quadrature decoder mode 0 */
#define TIMER_QUAD_DECODER_MODE1            ((uint8_t)0x01U)                                       /*!< quadrature decoder mode 1 */
#define TIMER_QUAD_DECODER_MODE2            ((uint8_t)0x02U)                                       /*!< quadrature decoder mode 2 */
#define TIMER_SLAVE_MODE_RESTART            ((uint8_t)0x03U)                                       /*!< restart mode */
#define TIMER_SLAVE_MODE_PAUSE              ((uint8_t)0x04U)                                       /*!< pause mode */
#define TIMER_SLAVE_MODE_EVENT              ((uint8_t)0x05U)                                       /*!< event mode */
#define TIMER_SLAVE_MODE_EXTERNAL0          ((uint8_t)0x06U)                                       /*!< external clock mode 0 */
#define TIMER_DECODER_MODE0                 ((uint8_t)0x09U)                                       /*!< decoder mode 0 */
#define TIMER_DECODER_MODE1                 ((uint8_t)0x0AU)                                       /*!< decoder mode 1 */
#define TIMER_DECODER_MODE2                 ((uint8_t)0x0BU)                                       /*!< decoder mode 2 */
#define TIMER_DECODER_MODE3                 ((uint8_t)0x0CU)                                       /*!< decoder mode 3 */
#define TIMER_QUAD_DECODER_MODE3            ((uint8_t)0x0DU)                                       /*!< quadrature decoder mode 3 */
#define TIMER_QUAD_DECODER_MODE4            ((uint8_t)0x0EU)                                       /*!< quadrature decoder mode 4 */
#define TIMER_SLAVE_MODE_DISABLE            ((uint8_t)0x0FU)                                       /*!< slave mode disable */

#define SYSCFG_TIMERCFG0(syscfg_timerx)     REG32(SYSCFG + 0x100U + (syscfg_timerx) * 0x0CU)       /*!< TIMERx configuration register */
#define SYSCFG_TIMERCFG1(syscfg_timerx)     REG32(SYSCFG + 0x104U + (syscfg_timerx) * 0x0CU)       /*!< TIMERx configuration register */
#define SYSCFG_TIMERCFG2(syscfg_timerx)     REG32(SYSCFG + 0x108U + (syscfg_timerx) * 0x0CU)       /*!< TIMERx configuration register */

#define SYSCFG_TIMERCFG(syscfg_timerx)      ((uint32_t)(SYSCFG_BASE + 0x100U + (syscfg_timerx) * 0x0CU))

#define SYSCFG_TIMER0                       ((uint8_t)0x00U)                                       /*!< SYSCFG TIMER0 */
#define SYSCFG_TIMER1                       ((uint8_t)0x01U)                                       /*!< SYSCFG TIMER1 */
#define SYSCFG_TIMER2                       ((uint8_t)0x02U)                                       /*!< SYSCFG TIMER2 */
#define SYSCFG_TIMER3                       ((uint8_t)0x03U)                                       /*!< SYSCFG TIMER3 */
#define SYSCFG_TIMER4                       ((uint8_t)0x04U)                                       /*!< SYSCFG TIMER4 */
#define SYSCFG_TIMER7                       ((uint8_t)0x05U)                                       /*!< SYSCFG TIMER5 */
#define SYSCFG_TIMER15                      ((uint8_t)0x06U)                                       /*!< SYSCFG TIMER6 */
#define SYSCFG_TIMER16                      ((uint8_t)0x07U)                                       /*!< SYSCFG TIMER7 */

/* function declarations */
/* initialization functions */
/* reset SYSCFG register values */
void syscfg_deinit(void);

/* SYSCFG configuration functions */
/* get boot mode */
uint32_t syscfg_bootmode_get(void);
/* enable I2Cx Fast Mode Plus */
void syscfg_i2c_fast_mode_plus_enable(uint32_t i2c_fmp);
/* disable I2Cx Fast Mode Plus */
void syscfg_i2c_fast_mode_plus_disable(uint32_t i2c_fmp);

/* lockup configuration functions */
/* enable module lockup function (function can be disabled by system reset) */
void syscfg_lockup_enable(uint32_t lockup);

/* bus timeout configuration functions */
/* enable bus timeout */
void syscfg_bus_timeout_enable(uint32_t busto);
/* disable bus timeout */
void syscfg_bus_timeout_disable(uint32_t busto);

/* timer input configuration functions */
/* Select TIMER channel input source */
void syscfg_timer_input_source_select(timer_channel_input_enum timer_input);

/* SRAM configuration functions */
/* enable SRAM page write protection */
void syscfg_sram_page_wp_enable(uint32_t page);

/* SRAM ECC error information functions */
/* get SRAM ECC single-bit error bit position */
uint32_t syscfg_sram_ecc_error_bit_get(void);
/* get SRAM ECC error address */
uint32_t syscfg_sram_ecc_error_addr_get(void);

/* FPU interrupt configuration functions */
/* enable FPU interrupt */
void syscfg_fpu_interrupt_enable(uint32_t interrupt);
/* disable FPU interrupt */
void syscfg_fpu_interrupt_disable(uint32_t interrupt);

/* SRAM ECC interrupt configuration functions */
/* enable SRAM ECC error interrupt */
void syscfg_sram_ecc_interrupt_enable(uint32_t sram_ecc);
/* disable SRAM ECC error interrupt */
void syscfg_sram_ecc_interrupt_disable(uint32_t sram_ecc);
/* get bus timeout flag */
FlagStatus syscfg_bus_timeout_flag_get(uint32_t bustoflag);
/* clear bus timeout flag */
void syscfg_bus_timeout_flag_clear(uint32_t bustoflag);
/* get SRAM ECC error flag */
FlagStatus syscfg_sram_ecc_flag_get(uint32_t ecc_flag);
/* clear SRAM ECC error flag */
void syscfg_sram_ecc_flag_clear(uint32_t ecc_flag);

#endif /* GD32F50X_SYSCFG_H */
